

# "1st program"

print("Ответ первой задачи: ", (9**0.5)*5) # возведение числа 9 в степень 0.5, после умножение на 5.

# "2nd program"

print("Ответ второй задачи: ", 9.99 > 9.98 and 1000 != 1000.1) # Убедитесь в том что 9.99 больше 9.98 и 1000 не равно 1000.1

# "3rd program"

first_1 = 1234
second_1 = 5678

sum = first_1//10%100 + second_1//10%100 # Дано два целых четырёхзначных числа: 1234 и 5678. Выведите на экран(в консоль) сумму серединных чисел

print(sum)

# "4th program"

first_2 = 13.42
second_2 = 42.13


# Дано два дробных числа: 13.42 и 42.13. Необходимо убедиться в том, что целая часть хотя бы одного из чисел равна дробной части другого.

print(first_2*100//100 == second_2*100%100 or second_2*100//100 == first_2*100%100)




