import pandas as pd

# Загрузка данных из CSV файла с учетом разделителя ';' и преобразование телефонов в строки
rister = pd.read_csv('rister2.csv', sep=';', on_bad_lines='skip', dtype=str)

# Список столбцов для заполнения 'Контакт: Мобильный телефон'
alternative_columns = [
    'Контакт: Рабочий телефон',
    'Контакт: Номер факса',
    'Контакт: Домашний телефон',
    'Контакт: Номер пейджера',
    'Контакт: Телефон для рассылок',
    'Контакт: Другой телефон'
]

# Заполнение пустых значений в столбце 'Контакт: Мобильный телефон'
for col in alternative_columns:
    rister['Контакт: Мобильный телефон'] = rister['Контакт: Мобильный телефон'].fillna(rister[col])

# Удаление десятичных точек из телефонов
rister['Контакт: Мобильный телефон'] = rister['Контакт: Мобильный телефон'].str.replace('.0', '', regex=False)

# Сохранение обновленных данных в новый файл
rister.to_csv('updated_rister.csv', sep=';', index=False)

print("Мобильные телефоны успешно обновлены и сохранены в 'updated_rister.csv'!")
